Show / Hide Table of Contents
Class MatPrestressSteelSIA
Material prestressing steel SIA
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatPrestressSteel
MatPrestressSteelSIA
Inherited Members
 MatPrestressSteel.Diameter
 MatPrestressSteel.Area
 MatPrestressSteel.NumberOfWires
 MatPrestressSteel.EquivalentDiameter
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.SIA.MatPrestressSteelSIA,CI.Material", "CI.StructModel.Libraries.Material.IMatPrestressSteel,CI.BasicTypes", typeof(MatPrestressSteel))]
public class MatPrestressSteelSIA : MatPrestressSteel
Constructors
Improve this Doc   View Source
MatPrestressSteelSIA()
Constructor
Declaration
public MatPrestressSteelSIA()
Properties
Improve this Doc   View Source
DiagramType
Type of diagram
Declaration
public ReinfDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 ReinfDiagramType
Improve this Doc   View Source
Epsud
dimensioning value of ultimate strain of reinforcing steel or prestressing steel
Declaration
public double Epsud { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Epsuk
characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel
Declaration
public double Epsuk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fp01k
characteristic value of yield strength of prestressing steel
Declaration
public double Fp01k { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fpd
dimensioning value of yield strength of prestressing steel
Declaration
public double Fpd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fpk
characteristic value of tensile strength of prestressing steel
Declaration
public double Fpk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
SurfaceCharacteristic
Surface characteristic
Declaration
public SurfaceCharacteristicTypeSIA SurfaceCharacteristic { get; set; }
Property Value
 Type |  Description
 SurfaceCharacteristicTypeSIA
Improve this Doc   View Source
Type
Type of prestress steel
Declaration
public PrestressSteelTypeSIA Type { get; set; }
Property Value
 Type |  Description
 PrestressSteelTypeSIA
 Improve this Doc
 View Source